FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_EMAC.c
#define PHY_FULLD_100M      0x2100      /* Full Duplex 100Mbit               */
#define PHY_HALFD_100M      0x2000      /* Half Duplex 100Mbit               */
#define PHY_FULLD_10M       0x0100      /* Full Duplex 10Mbit                */
#define PHY_HALFD_10M       0x0000      /* Half Duplex 10MBit                */
#define PHY_AUTO_NEG        0x3000      /* Select Auto Negotiation           */

/* BMSR setting */
#define BMSR_100BE_T4		0x8000
#define BMSR_100TX_FULL		0x4000
#define BMSR_100TX_HALF		0x2000
#define BMSR_10BE_FULL		0x1000
#define BMSR_10BE_HALF		0x0800
#define BMSR_AUTO_DONE		0x0020
#define BMSR_REMOTE_FAULT	0x0010
#define BMSR_NO_AUTO		0x0008
#define BMSR_LINK_ESTABLISHED	0x0004

#define EMAC_INT_RXDONE     0x01 << 3

/* Below is the Micrel PHY definition used for IAR LPC23xx and
Embedded Artists LPC24xx board. */
#define MIC_PHY_RXER_CNT			0x0015
#define MIC_PHY_INT_CTRL			0x001B
#define MIC_PHY_LINKMD_CTRL			0x001D
#define MIC_PHY_PHY_CTRL			0x001E
#define MIC_PHY_100BASE_PHY_CTRL	0x001F

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    const HAL_EMAC *iHAL;
    T_EMACSettings iSettings;
    TUInt16 *rptr;
    TUInt16 *tptr;
    T_uezEMACReceiveInterruptCallback iReceiveCallback;
    void *iReceiveCallbackWorkspace;
} T_LPC1768_EMAC_Workspace;

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
extern const HAL_EMAC EMAC_LPC1768_Interface;
static T_LPC1768_EMAC_Workspace *G_LPC1768_EMAC;

/*---------------------------------------------------------------------------*
 * Routine:  IPHYWrite
 *---------------------------------------------------------------------------*
 * Description:
 *      Write the register in the given PHY to the given value.
 * Inputs:
 *      T_LPC1768_EMAC_Workspace *p -- EMAC's Workspace
 *      TUInt32 aPhyReg             -- PHY register to write
 *      TUInt32 aValue              -- Value to write to register
 *---------------------------------------------------------------------------*/
static void IPHYWrite(T_LPC1768_EMAC_Workspace *p, TUInt8 PhyReg, TUInt32 Value)
{
    TUInt32 timeout;

    // Write the PHY's register with the value
    LPC_EMAC->MADR = p->iSettings.iPHYAddr | PhyReg;
    LPC_EMAC->MWTD = Value;

    // Wait utill operation completed
    for (timeout=0; timeout < MII_WR_TOUT; timeout++) {
        if ((LPC_EMAC->MIND & MIND_BUSY) == 0) {
            break;
        }
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  IPHYRead
 *---------------------------------------------------------------------------*
 * Description:
 *      Read the register from the given PHY.
 * Inputs:
 *      T_LPC1768_EMAC_Workspace *p -- EMAC's Workspace
 *      TUInt32 aPhyReg             -- PHY register to write
 *      TUInt32 aValue              -- Value to write to register
 *---------------------------------------------------------------------------*/
static TUInt16 IPHYRead(T_LPC1768_EMAC_Workspace *p, TUInt8 PhyReg)
{
    TUInt32 timeout;

    // Read the PHY's register
    LPC_EMAC->MADR = p->iSettings.iPHYAddr | PhyReg;
    LPC_EMAC->MCMD = MCMD_READ;

    // Wait until operation completed
    for (timeout=0; timeout < MII_RD_TOUT; timeout++) {
        if ((LPC_EMAC->MIND & MIND_BUSY) == 0) {
            break;
        }
    }
    LPC_EMAC->MCMD = 0;

    return (LPC_EMAC->MRDD);
}

/*---------------------------------------------------------------------------*
 * Routine:  IEMACConfigPHY_National
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure for the National PHY
 * Inputs:
 *      T_LPC1768_EMAC_Workspace *p -- EMAC's Workspace
 *---------------------------------------------------------------------------*/
static T_uezError IEMACConfigPHY_National(T_LPC1768_EMAC_Workspace *p)
{
    T_uezError error = UEZ_ERROR_NONE;
    TUInt32 timeout, regv;

    // Force ON Auto-MDIX
    IPHYWrite(p, PHY_REG_PHYCR, IPHYRead(p, PHY_REG_PHYCR)|(1<<15));

    // auto negotiation, restart AN
    // RE_AN should be self cleared
    IPHYWrite(p, PHY_REG_BMCR, PHY_AUTO_NEG);

    // Wait to complete Auto_Negotiation.
    for (timeout = 0; timeout < 10; timeout++) {
        UEZBSPDelayMS(100);
        regv = IPHYRead(p, PHY_REG_BMSR);
        if (regv & 0x0020) {
            // Autonegotiation Complete.
            break;
        }
    }

    // Check the link status.
    if (error == UEZ_ERROR_NONE)  {
        error = UEZ_ERROR_TIMEOUT;
        for (timeout = 0; timeout < 10; timeout++) {
            UEZBSPDelayMS(100);
            regv = IPHYRead(p, PHY_REG_STS);
            if (regv & 0x0001) {
                // Link is on.
                error = UEZ_ERROR_NONE;
                break;
            }
        }
    }

    if (error == UEZ_ERROR_NONE) {
        // Configure Full/Half Duplex mode.
        if (regv & 0x0004) {
            // Full duplex is enabled.
            LPC_EMAC->MAC2    |= MAC2_FULL_DUP;
            LPC_EMAC->Command |= CR_FULL_DUP;
            LPC_EMAC->IPGT    = IPGT_FULL_DUP;
        } else {
            // Half duplex mode.
            LPC_EMAC->IPGT = IPGT_HALF_DUP;
        }

        // Configure 100MBit/10MBit mode.
        if (regv & 0x0002) {
            // 10MBit mode.
            LPC_EMAC->SUPP = 0;
        } else {
            // 100MBit mode.
            LPC_EMAC->SUPP = SUPP_SPEED;
        }
    }

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IEMACConfigPHY_Micrel
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure for the Micrel PHY
 * Inputs:
 *      T_LPC1768_EMAC_Workspace *p -- EMAC's Workspace
 *---------------------------------------------------------------------------*/
static T_uezError IEMACConfigPHY_Micrel(T_LPC1768_EMAC_Workspace *p)
{
    T_uezError error = UEZ_ERROR_NONE;
    TUInt32 timeout, regv;
#if DEBUG_LPC1768_EMAC_STARTUP
    TUInt32 reg;
#endif
    // auto negotiation, restart AN
    // RE_AN should be self cleared
    IPHYWrite(p, PHY_REG_BMCR, PHY_AUTO_NEG);

