FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_EMAC.c
    // Wait to complete Auto_Negotiation.
    for (timeout = 0; timeout < 30; timeout++) {
#if DEBUG_LPC1768_EMAC_STARTUP
    printf(".");
#endif
        UEZBSPDelayMS(100);
        regv = IPHYRead(p, PHY_REG_BMSR);
        if (regv & (BMSR_AUTO_DONE|BMSR_LINK_ESTABLISHED)) {
            // Autonegotiation Complete.
            break;
        }
    }

    regv = IPHYRead(p, MIC_PHY_100BASE_PHY_CTRL);
#if DEBUG_LPC1768_EMAC_STARTUP
    printf("nego regv %04X\n", regv);
#endif
    // successful negotiations; update link info
    regv &= 0x001C;
    switch (regv)  {
        case 0x0004:
            // Half duplex mode.
            // 10MBit mode.
            LPC_EMAC->SUPP    &= ~SUPP_SPEED;
            LPC_EMAC->MAC2    &= ~MAC2_FULL_DUP;
            LPC_EMAC->Command &= ~CR_FULL_DUP;
            LPC_EMAC->IPGT     = IPGT_HALF_DUP;
            break;
        case 0x0008:
            // Half duplex mode.
            // 100MBit mode.
            LPC_EMAC->SUPP    |= SUPP_SPEED;
            LPC_EMAC->MAC2    &= ~MAC2_FULL_DUP;
            LPC_EMAC->Command &= ~CR_FULL_DUP;
            LPC_EMAC->IPGT     = IPGT_HALF_DUP;
            break;
        case 0x0014:
            // Full duplex is enabled.
            // 10MBit mode.
            LPC_EMAC->SUPP    &= ~SUPP_SPEED;
            LPC_EMAC->MAC2    |= MAC2_FULL_DUP;
            LPC_EMAC->Command |= CR_FULL_DUP;
            LPC_EMAC->IPGT     = IPGT_FULL_DUP;
            break;
        case 0x0018:
            // Full duplex is enabled.
            // 100MBit mode.
            LPC_EMAC->SUPP    |= SUPP_SPEED;
            LPC_EMAC->MAC2    |= MAC2_FULL_DUP;
            LPC_EMAC->Command |= CR_FULL_DUP;
            LPC_EMAC->IPGT     = IPGT_FULL_DUP;
            break;
        default:	// Should not come here, force to set default, 100 FULL_DUPLEX
            // Full duplex is enabled.
            // 100MBit mode.
            LPC_EMAC->SUPP    |= SUPP_SPEED;
            LPC_EMAC->MAC2    |= MAC2_FULL_DUP;
            LPC_EMAC->Command |= CR_FULL_DUP;
            LPC_EMAC->IPGT     = IPGT_FULL_DUP;
            break;
    }

#if DEBUG_LPC1768_EMAC_STARTUP
    for (reg=0; reg<32; reg++) {
        regv = IPHYRead(p, reg);
        printf("phyreg %d = %04X\n", reg, regv);
    }
#endif

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IEMACConfigPHY_MicrelKSZ8001L
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure for the Micrel PHY KSZ8001L
 * Inputs:
 *      T_LPC1768_EMAC_Workspace *p -- EMAC's Workspace
 *---------------------------------------------------------------------------*/
static T_uezError IEMACConfigPHY_MicrelKSZ8001L(T_LPC1768_EMAC_Workspace *p)
{
    T_uezError error = UEZ_ERROR_NONE;
    TUInt32 timeout, regv;
    #define MICREL_KSZ8001L_TIMEOUT         10000 // 10 seconds
#if DEBUG_LPC1768_EMAC_STARTUP
    TUInt32 reg;
#endif
    // auto negotiation, restart AN
    // RE_AN should be self cleared
    IPHYWrite(p, PHY_REG_BMCR, PHY_AUTO_NEG);

    // Wait to complete Auto_Negotiation.
    for (timeout = 0; timeout < MICREL_KSZ8001L_TIMEOUT; timeout+=200) {
#if DEBUG_LPC1768_EMAC_STARTUP
    printf(".");
#endif
        UEZTaskDelay(200);
        regv = IPHYRead(p, PHY_REG_BMSR);
        if (regv & (BMSR_AUTO_DONE|BMSR_LINK_ESTABLISHED)) {
            // Autonegotiation Complete.
            break;
        }
    }
    if (timeout >= MICREL_KSZ8001L_TIMEOUT) {
        error = UEZ_ERROR_NOT_READY;
        return error;
    }

    regv = IPHYRead(p, MIC_PHY_100BASE_PHY_CTRL);
#if DEBUG_LPC1768_EMAC_STARTUP
    printf("nego regv %04X\n", regv);
#endif
    // successful negotiations; update link info
    regv &= 0x001C;
    switch (regv)  {
        case 0x0004:
            // Half duplex mode.
            // 10MBit mode.
            LPC_EMAC->SUPP    &= ~SUPP_SPEED;
            LPC_EMAC->MAC2    &= ~MAC2_FULL_DUP;
            LPC_EMAC->Command &= ~CR_FULL_DUP;
            LPC_EMAC->IPGT     = IPGT_HALF_DUP;
            break;
        case 0x0008:
            // Half duplex mode.
            // 100MBit mode.
            LPC_EMAC->SUPP    |= SUPP_SPEED;
            LPC_EMAC->MAC2    &= ~MAC2_FULL_DUP;
            LPC_EMAC->Command &= ~CR_FULL_DUP;
            LPC_EMAC->IPGT     = IPGT_HALF_DUP;
            break;
        case 0x0014:
            // Full duplex is enabled.
            // 10MBit mode.
            LPC_EMAC->SUPP    &= ~SUPP_SPEED;
            LPC_EMAC->MAC2    |= MAC2_FULL_DUP;
            LPC_EMAC->Command |= CR_FULL_DUP;
            LPC_EMAC->IPGT     = IPGT_FULL_DUP;
            break;
        case 0x0018:
            // Full duplex is enabled.
            // 100MBit mode.
            LPC_EMAC->SUPP    |= SUPP_SPEED;
            LPC_EMAC->MAC2    |= MAC2_FULL_DUP;
            LPC_EMAC->Command |= CR_FULL_DUP;
            LPC_EMAC->IPGT     = IPGT_FULL_DUP;
            break;
        default:	// Should not come here, force to set default, 100 FULL_DUPLEX
            // Full duplex is enabled.
            // 100MBit mode.
            LPC_EMAC->SUPP    |= SUPP_SPEED;
            LPC_EMAC->MAC2    |= MAC2_FULL_DUP;
            LPC_EMAC->Command |= CR_FULL_DUP;
            LPC_EMAC->IPGT     = IPGT_FULL_DUP;
            break;
    }

#if DEBUG_LPC1768_EMAC_STARTUP
    for (reg=0; reg<32; reg++) {
        regv = IPHYRead(p, reg);
        printf("phyreg %d = %04X\n", reg, regv);
    }
#endif

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1768_EMAC_InitRxDescriptors
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize Receive Descriptors
 *---------------------------------------------------------------------------*/
static void ILPC1768_EMAC_InitRxDescriptors(void)
{
    TUInt32 i;

    for (i = 0; i < NUM_RX_FRAG; i++) {
        RX_DESC_PACKET(i)  = RX_BUF(i);
        RX_DESC_CTRL(i)    = RCTRL_INT | (ETH_FRAG_SIZE-1);
        RX_STAT_INFO(i)    = 0;
        RX_STAT_HASHCRC(i) = 0;
    }

    // Set EMAC Receive Descriptor Registers.
    LPC_EMAC->RxDescriptor    = RX_DESC_BASE;
    LPC_EMAC->RxStatus        = RX_STAT_BASE;
    LPC_EMAC->RxDescriptorNumber = NUM_RX_FRAG-1;

