FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_EMAC.c
    /* Rx Descriptors Point to 0 */
    LPC_EMAC->RxConsumeIndex  = 0;
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1768_EMAC_InitTxDescriptors
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize Transmit Descriptors
 *---------------------------------------------------------------------------*/
void ILPC1768_EMAC_InitTxDescriptors(void)
{
    TUInt32 i;

    for (i = 0; i < NUM_TX_FRAG; i++) {
        TX_DESC_PACKET(i) = TX_BUF(i);
        TX_DESC_CTRL(i)   = 0;
        TX_STAT_INFO(i)   = 0;
    }

    /* Set EMAC Transmit Descriptor Registers. */
    LPC_EMAC->TxDescriptor    = TX_DESC_BASE;
    LPC_EMAC->TxStatus        = TX_STAT_BASE;
    LPC_EMAC->TxDescriptorNumber = NUM_TX_FRAG-1;

    /* Tx Descriptors Point to 0 */
    LPC_EMAC->TxProduceIndex  = 0;
}
/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the workspace for this EMAC Controller
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_EMAC_InitializeWorkspace(void *aWorkspace)
{
//    T_LPC1768_EMAC_Workspace *p = (T_LPC1768_EMAC_Workspace *)aWorkspace;

    G_LPC1768_EMAC = aWorkspace;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure and setup the EMAC screen with the given settings
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *      T_EMACSettings *aSettings -- Pointer to settings to use
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_EMAC_Configure(
            void *aWorkspace,
            T_EMACSettings *aSettings)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_LPC1768_EMAC_Workspace *p = (T_LPC1768_EMAC_Workspace *)aWorkspace;
    TUInt32 regv, timeout;
    TUInt32 retry;
#if DEBUG_LPC1768_EMAC_STARTUP
    TUInt32 addr=1;
    TUInt16 v;
#endif
    // Copy over the settings
    p->iSettings = *aSettings;

    // Shift the phy address now to make the calculations faster
    p->iSettings.iPHYAddr <<= 8;

    // Initializes the EMAC ethernet controller
    // Ensure EMAC is powered up
    LPC_SC->PCONP |= (1<<30);

    // Delay a small amount
    UEZBSPDelayMS(100);

    // Reset all EMAC internal modules.
    // TBD: Should we use rx and tx flow control since we might be running too slow
    LPC_EMAC->MAC1 = MAC1_RES_TX | MAC1_RES_MCS_TX | MAC1_RES_RX | MAC1_RES_MCS_RX |
        MAC1_SIM_RES | MAC1_SOFT_RES | MAC1_RX_FLOWC | MAC1_TX_FLOWC;
    LPC_EMAC->Command = CR_REG_RES | CR_TX_RES | CR_RX_RES;

    // A short delay after reset.
    UEZBSPDelayMS(1);

    // Initialize MAC control registers.
    LPC_EMAC->MAC1 = MAC1_PASS_ALL;
    LPC_EMAC->MAC2 = MAC2_CRC_EN | MAC2_PAD_EN;
    LPC_EMAC->MAXF = ETH_MAX_FLEN;
    LPC_EMAC->CLRT = CLRT_DEF;
    LPC_EMAC->IPGR = IPGR_DEF;

    // host clock divided by 28, no suppress preamble, no scan increment
    // TBD: Should this be calculated at run time?
    LPC_EMAC->MCFG = 0x801C;	
    UEZBSPDelayMS(10);

    // Apply a reset
    LPC_EMAC->MCFG = 0x0018;	
    LPC_EMAC->MCMD = 0;

    // RMII configuration
    LPC_EMAC->Command |= CR_RMII;

    // PHY support: [8]=0 ->10 Mbps mode, =1 -> 100 Mbps mode
    // RMII setting, at power-on, default set to 100.
    LPC_EMAC->SUPP = SUPP_SPEED;	

    UEZBSPDelayMS(100);

#if DEBUG_LPC1768_EMAC_STARTUP
    for (addr=0; addr<16; addr++) {
        p->iSettings.iPHYAddr = addr<<8;
        v = IPHYRead(p, PHY_REG_IDR1);
        printf("ADDR: %d, v=%04X\n", addr, v);
        if (v != 0xFFFF) {
            break;
        }
    }
    printf("Addr: %d, Settings: %08X\n", addr, p->iSettings.iPHYAddr);
#endif

    /* Put the Phy in reset mode */
    IPHYWrite(p, PHY_REG_BMCR, 0x8000);
    UEZBSPDelayMS(1000);

    // Wait for hardware reset to end.
    // We try 500 times with a 10 ms delay for a complete
    // time of 1 second.
    retry = 3;
    do {
        for (timeout = 0; timeout < 500; timeout++) {
            UEZBSPDelayMS(10);
            regv = IPHYRead(p, PHY_REG_BMCR);
            if (!(regv & 0x8000)) {
                // Reset complete
                break;
            }
        }
#if DEBUG_LPC1768_EMAC_STARTUP
        printf("regv=%04X\n", regv);
#endif
    } while ((timeout == 100) && (--retry));

    if (!retry) {
        // report a timeout on the initialization
        return UEZ_ERROR_TIMEOUT;
    }

    // Setup PAUSE control (PAUSE and ASM_DIR in ANAR register)
    regv = IPHYRead(p, PHY_REG_ANAR);
#if DEBUG_LPC1768_EMAC_STARTUP
    printf("pause regv=%04X\n", regv);
#endif
    IPHYWrite(p, PHY_REG_ANAR, regv|(1<<10)|(1<<11));

    switch ((IPHYRead(p, PHY_REG_IDR1)<<16)|IPHYRead(p, PHY_REG_IDR2))  {
        case 0x20005C90:    // National PHY
            error = IEMACConfigPHY_National(p);
            break;
        case 0x00221610:    // Micrel
        case 0x00221512:    // Micrel KSZ8041TL-FTL
#if DEBUG_LPC1768_EMAC_STARTUP
            printf("Micrel init\n");
#endif
            error = IEMACConfigPHY_Micrel(p);
            break;
        default:
            // auto negotiation, restart AN
            // RE_AN should be self cleared
            IPHYWrite(p, PHY_REG_BMCR, PHY_AUTO_NEG);
            return UEZ_ERROR_NOT_SUPPORTED;
        case 0x00221613:    // Micrel KSZ8001L
#if DEBUG_LPC1768_EMAC_STARTUP
            printf("Micrel KSZ8001L init\n");
#endif
            error = IEMACConfigPHY_MicrelKSZ8001L(p);
            break;
    }

    LPC_EMAC->SA0 = (p->iSettings.iMACAddress[5] << 8) | p->iSettings.iMACAddress[4];
    LPC_EMAC->SA1 = (p->iSettings.iMACAddress[3] << 8) | p->iSettings.iMACAddress[2];
    LPC_EMAC->SA2 = (p->iSettings.iMACAddress[1] << 8) | p->iSettings.iMACAddress[0];

