FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_EMAC.c
    // Initialize Tx and Rx DMA Descriptors
    ILPC1768_EMAC_InitRxDescriptors();
    ILPC1768_EMAC_InitTxDescriptors();

    // Receive Broadcast and Perfect Match Packets
    //Ake changed, RFC_UCAST_EN seems to be incorrect.
    //RxFilterCtrl = RFC_UCAST_EN | RFC_BCAST_EN | RFC_PERFECT_EN;
    LPC_EMAC->RxFilterCtrl = RFC_BCAST_EN | RFC_PERFECT_EN;

    // Create the semaphore used ot wake the uIP task.
//??    vSemaphoreCreateBinary( xEMACSemaphore );

    // Reset all interrupts
    LPC_EMAC->IntClear  = 0xFFFF;

    /* Enable receive and transmit mode of MAC Ethernet core */
    LPC_EMAC->Command  |= (CR_RX_EN | CR_TX_EN);
    LPC_EMAC->MAC1     |= MAC1_REC_EN;

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_CheckFrameReceived
 *---------------------------------------------------------------------------*
 * Description:
 *      Determine if a frame has been received.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 * Outputs:
 *      TBool                     -- ETrue if frame received, else EFalse.
 *---------------------------------------------------------------------------*/
TBool LPC1768_EMAC_CheckFrameReceived(void *aWorkspace)
{
    // more packets received ?
    if (LPC_EMAC->RxProduceIndex != LPC_EMAC->RxConsumeIndex)
        return ETrue;
    return EFalse;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_StartReadFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Reads the length of the received ethernet frame.  Returns the
 *      frame length.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 * Outputs:
 *      TUInt16                   -- Size of frame
 *---------------------------------------------------------------------------*/
TUInt16 LPC1768_EMAC_StartReadFrame(void *aWorkspace)
{
    TUInt16 RxLen;
    TUInt32 idx;
    T_LPC1768_EMAC_Workspace *p = (T_LPC1768_EMAC_Workspace *)aWorkspace;

    idx = LPC_EMAC->RxConsumeIndex;
    RxLen = (RX_STAT_INFO(idx) & RINFO_SIZE) - 3;
    p->rptr = (TUInt16 *)RX_DESC_PACKET(idx);

    return RxLen;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_EndReadFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      End the last frame.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *---------------------------------------------------------------------------*/
void LPC1768_EMAC_EndReadFrame(void *aWorkspace)
{
    TUInt32 idx;

    // DMA free packet.
    idx = LPC_EMAC->RxConsumeIndex;
    if (++idx == NUM_RX_FRAG)
        idx = 0;
    LPC_EMAC->RxConsumeIndex = idx;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_RequestSend
 *---------------------------------------------------------------------------*
 * Description:
 *      Requests space in EMAC memory for storing an outgoing frame
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *---------------------------------------------------------------------------*/
void LPC1768_EMAC_RequestSend(void *aWorkspace)
{
    T_LPC1768_EMAC_Workspace *p = (T_LPC1768_EMAC_Workspace *)aWorkspace;
    TUInt32 idx;

    idx  = LPC_EMAC->TxProduceIndex;
    p->tptr = (TUInt16 *)TX_DESC_PACKET(idx);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_DoSend
 *---------------------------------------------------------------------------*
 * Description:
 *      Send the frame
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      TUInt16 aFrameSize          -- Size of frame
 *---------------------------------------------------------------------------*/
void LPC1768_EMAC_DoSend(void *aWorkspace, TUInt16 aFrameSize)
{
    TUInt32 idx;

    idx = LPC_EMAC->TxProduceIndex;
    TX_DESC_CTRL(idx) = (aFrameSize-1) | TCTRL_LAST; /*Corrected problem with the size, -1 was missing*/
    if (++idx == NUM_TX_FRAG)
        idx = 0;
    LPC_EMAC->TxProduceIndex = idx;
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1768_WriteTxFrameData
 *---------------------------------------------------------------------------*
 * Description:
 *      Writes a word in little-endian byte order to TX_BUFFER
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      TUInt16 aData               -- Data to write
 *---------------------------------------------------------------------------*/
static void ILPC1768_WriteTxFrameData(T_LPC1768_EMAC_Workspace *p, TUInt16 aData)
{
    *(p->tptr++) = aData;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_CopyToFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Copies bytes from MCU-memory to frame port
 *      NOTES:
 *        - an odd number of byte may only be transfered
 *                  if the frame is written to the end!
 *        - MCU-memory MUST start at word-boundary
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      void *aSource               -- Location of data to send
 *      TUInt32 aSize               -- Number of bytes to send
 *---------------------------------------------------------------------------*/
void LPC1768_EMAC_CopyToFrame(
            void *aWorkspace,
            void *aSource,
            TUInt32 aSize)
{
    T_LPC1768_EMAC_Workspace *p = (T_LPC1768_EMAC_Workspace *)aWorkspace;
    TUInt16 *piSource;

    piSource = aSource;
    aSize = (aSize + 1) & 0xFFFE;    // round Size up to next even number
    while (aSize > 0) {
        ILPC1768_WriteTxFrameData(p, *piSource++);
        aSize -= 2;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1768_ReadRxFrameData
 *---------------------------------------------------------------------------*
 * Description:
 *      Reads a word in little-endian byte order from RX_BUFFER
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 * Outputs:
 *      TUInt16 aData               -- Data read
 *---------------------------------------------------------------------------*/
TUInt16 ILPC1768_ReadRxFrameData(T_LPC1768_EMAC_Workspace *p)
{
    return (*(p->rptr++));
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_CopyFromFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Copies bytes from frame port to MCU-memory
 *      NOTES:
 *          - an odd number of byte may only be transfered
 *              if the frame is read to the end!
 *          - MCU-memory MUST start at word-boundary
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      void *aDestination          -- Location to store data
 *      TUInt32 aSize               -- Number of bytes to copy
 *---------------------------------------------------------------------------*/
void LPC1768_EMAC_CopyFromFrame(
                void *aWorkspace,
                void *aDestination,
                TUInt32 aSize)
{
    T_LPC1768_EMAC_Workspace *p = (T_LPC1768_EMAC_Workspace *)aWorkspace;
    // Keil: Pointer added to correct expression
    TUInt16 *piDest;

