FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_EMAC.c
    // Keil: Line added
    piDest = aDestination;
    while (aSize > 1) {
        *piDest++ = ILPC1768_ReadRxFrameData(p);
        aSize -= 2;
    }

    // check for leftover byte...
    if (aSize) {
        // the LAN-Controller will return 0 for the highbyte
        *(TUInt8 *)piDest = (TUInt8)ILPC1768_ReadRxFrameData(p);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_ProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      An interrupt on this EMAC has been received.  Catch it and
 *      possible pass it on to a callback routine.
 *---------------------------------------------------------------------------*/
static void LPC1768_EMAC_ProcessInterrupt(void)
{
    T_LPC1768_EMAC_Workspace *p = G_LPC1768_EMAC;
    TUInt32 status;

    // Clear the interrupt.
    status = LPC_EMAC->IntStatus;
    if (status & EMAC_INT_RXDONE) {
        if (p->iReceiveCallback) {
            p->iReceiveCallback(p->iReceiveCallbackWorkspace);
        }
    }
    // Clear any interrupts that triggered this code
    LPC_EMAC->IntClear = status;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_ISR
 *---------------------------------------------------------------------------*
 * Description:
 *      Stub to catch a EMAC interrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(LPC1768_EMAC_ISR)
{
    IRQ_START();
    LPC1768_EMAC_ProcessInterrupt();
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_EnableReceiveInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable interrupts to occur when packets are received by the EMAC
 *      instead of just polling for the data.  The given callback routine
 *      will be called per interrupt.  The callback routine is called
 *      from withing the interrupt routine, so it should merely set
 *      a flag, release a semaphore, or any other minimal processing, and
 *      return quickly.
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      T_uezEMACReceiveInterruptCallback aCallback -- Routine to call on
 *          interrupts.  Can be set to 0 for no processing.
 *      void *aCallbackWorkspace -- Workspace pointer to pass to callback
 *          or 0 for none.
 *---------------------------------------------------------------------------*/
void LPC1768_EMAC_EnableReceiveInterrupt(
        void *aWorkspace,
        T_uezEMACReceiveInterruptCallback aCallback,
        void *aCallbackWorkspace)
{
    T_LPC1768_EMAC_Workspace *p = (T_LPC1768_EMAC_Workspace *)aWorkspace;

    p->iReceiveCallback = aCallback;
    p->iReceiveCallbackWorkspace = aCallbackWorkspace;
    // Register this interrupt (if not already)
    InterruptRegister(ENET_IRQn, (TISRFPtr)LPC1768_EMAC_ISR,
            INTERRUPT_PRIORITY_HIGH, "EMAC");
    InterruptEnable(ENET_IRQn);
    // Turn on those types of interrupts
    LPC_EMAC->IntEnable = INT_RX_DONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_EMAC_DisableReceiveInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Disables receive interrupts from the EMAC.
 *---------------------------------------------------------------------------*/
void LPC1768_EMAC_DisableReceiveInterrupt(void *aWorkspace)
{
    // Turn off those types of interrupts
    LPC_EMAC->IntClear = INT_RX_DONE;
    // Turn off the whole interrutp since it is the only one
    InterruptEnable(ENET_IRQn);
}

/*---------------------------------------------------------------------------*
* HAL Interface table:
*---------------------------------------------------------------------------*/
const HAL_EMAC G_LPC1768_EMAC_Interface = {
    {
	"LPC1768 EMAC",
        0x0100,
        LPC1768_EMAC_InitializeWorkspace,
        sizeof(T_LPC1768_EMAC_Workspace),
    },

    LPC1768_EMAC_Configure,
    LPC1768_EMAC_CheckFrameReceived,
    LPC1768_EMAC_StartReadFrame,
    LPC1768_EMAC_EndReadFrame,
    LPC1768_EMAC_RequestSend,
    LPC1768_EMAC_DoSend,
    LPC1768_EMAC_CopyToFrame,
    LPC1768_EMAC_CopyFromFrame,

    // uEZ v2.02
    LPC1768_EMAC_EnableReceiveInterrupt,
    LPC1768_EMAC_DisableReceiveInterrupt,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1768_EMAC_RMII_Require(const T_LPC1768_EMAC_Settings *aSettings)
{
    static const T_LPC1768_IOCON_ConfigList pinsTX_EN[] = {
            {GPIO_P1_4,  IOCON_D_DEFAULT(1)}, // ENET_TX_EN
    };

    static const T_LPC1768_IOCON_ConfigList pinsTXD1[] = {
            {GPIO_P1_1,  IOCON_D_DEFAULT(1)}, // ENET_TXD[1]
    };
    static const T_LPC1768_IOCON_ConfigList pinsTXD0[] = {
            {GPIO_P1_0,  IOCON_D_DEFAULT(1)}, // ENET_TXD[0]
    };

    static const T_LPC1768_IOCON_ConfigList pinsRXD1[] = {
            {GPIO_P1_10, IOCON_D_DEFAULT(1)}, // ENET_RXD[1]
    };
    static const T_LPC1768_IOCON_ConfigList pinsRXD0[] = {
            {GPIO_P1_9,  IOCON_D_DEFAULT(1)}, // ENET_RXD[0]
    };
    static const T_LPC1768_IOCON_ConfigList pinsRX_ER[] = {
            {GPIO_P1_14, IOCON_D_DEFAULT(1)}, // ENET_RX_ER
    };
    static const T_LPC1768_IOCON_ConfigList pinsRX_CLK[] = {
            {GPIO_P1_15, IOCON_D_DEFAULT(1)}, // ENET_RX_CLK
    };

    static const T_LPC1768_IOCON_ConfigList pinsCRS[] = {
            {GPIO_P1_8,  IOCON_D_DEFAULT(1)}, // ENET_CRS
    };
    static const T_LPC1768_IOCON_ConfigList pinsMDC[] = {
            {GPIO_P1_16, IOCON_D_DEFAULT(1)}, // ENET_MDC
            {GPIO_P2_8,  IOCON_D_DEFAULT(4)}, // ENET_MDC
    };
    static const T_LPC1768_IOCON_ConfigList pinsMDIO[] = {
            {GPIO_P1_17, IOCON_D_DEFAULT(1)}, // ENET_MDIO
            {GPIO_P2_9,  IOCON_D_DEFAULT(4)}, // ENET_MDIO
    };
    HAL_DEVICE_REQUIRE_ONCE();

    // Register EMAC
    HALInterfaceRegister("EMAC", (T_halInterface *)&G_LPC1768_EMAC_Interface,
            0, 0);
    LPC1768_IOCON_ConfigPin(aSettings->iTX_EN, pinsTX_EN,
            ARRAY_COUNT(pinsTX_EN));
    LPC1768_IOCON_ConfigPin(aSettings->iTXD1, pinsTXD1, ARRAY_COUNT(pinsTXD1));
    LPC1768_IOCON_ConfigPin(aSettings->iTXD0, pinsTXD0, ARRAY_COUNT(pinsTXD0));
    LPC1768_IOCON_ConfigPin(aSettings->iRXD1, pinsRXD1, ARRAY_COUNT(pinsRXD1));
    LPC1768_IOCON_ConfigPin(aSettings->iRXD0, pinsRXD0, ARRAY_COUNT(pinsRXD0));
    LPC1768_IOCON_ConfigPin(aSettings->iRX_ER, pinsRX_ER,
            ARRAY_COUNT(pinsRX_ER));
    LPC1768_IOCON_ConfigPin(aSettings->iRX_CLK, pinsRX_CLK,
            ARRAY_COUNT(pinsRX_CLK));
    LPC1768_IOCON_ConfigPin(aSettings->iCRS, pinsCRS, ARRAY_COUNT(pinsCRS));
    LPC1768_IOCON_ConfigPin(aSettings->iMDC, pinsMDC, ARRAY_COUNT(pinsMDC));
    LPC1768_IOCON_ConfigPin(aSettings->iMDIO, pinsMDIO, ARRAY_COUNT(pinsMDIO));
}

/*-------------------------------------------------------------------------*
 * End of File:  EMAC.c
 *-------------------------------------------------------------------------*/
